thooge/esp32-nmea2000-obp60/lib/obp60task/OBPSensorTask.cpp
#if defined BOARD_OBP60S3 || defined BOARD_OBP40S3
#include <Adafruit_Sensor.h>            // Adafruit Lib for sensors
#include <Adafruit_BME280.h>            // Adafruit Lib for BME280
#include <Adafruit_BMP280.h>            // Adafruit Lib for BMP280
#include <Adafruit_BMP085.h>            // Adafruit Lib for BMP085 and BMP180
#include <HTU21D.h>                     // Lib for SHT21/HTU21
#include "AS5600.h"                     // Lib for magnetic rotation sensor AS5600
#include <INA226.h>                     // Lib for power management IC INA226
#include <Ticker.h>                     // Timer Lib for timer
#include <RTClib.h>                     // DS1388 RTC
#include <OneWire.h>                    // 1Wire Lib
#include <DallasTemperature.h>          // Lib for DS18B20
#include "OBPSensorTask.h"              // Lib for sensor reading
#include "OBP60Hardware.h"              // Hardware definitions
#include "N2kMessages.h"                // Lib for NMEA2000
#include "NMEA0183.h"                   // Lib for NMEA0183
#include "ObpNmea0183.h"                // Check NMEA0183 sentence for uncorrect content
#include "OBP60Extensions.h"            // Lib for hardware extensions
#include "movingAvg.h"                  // Lib for moving average building
#include "time.h"                       // For getting NTP time
#include <ESP32Time.h>                  // Internal ESP32 RTC clock

// Timer for hardware functions
Ticker Timer1(blinkingFlashLED, 500);   // Start Timer1 for flash LED all 500ms

// Initialization for all sensors (RS232, I2C, 1Wire, IOs)
//####################################################################################

void sensorTask(void *param){
    SharedData *shared = (SharedData *)param;
    GwApi *api = shared->api;
    GwLog *logger = api->getLogger();
    LOG_DEBUG(GwLog::LOG, "Sensor task started");
    SensorData sensors;
    ObpNmea0183 NMEA0183;

    Adafruit_BME280 bme280;         // Evironment sensor BME280
    Adafruit_BMP280 bmp280;         // Evironment sensor BMP280
    Adafruit_BMP085 bmp085;         // Evironment sensor BMP085 and BMP180
    HTU21D sht21(HTU21D_RES_RH12_TEMP14); // Environment sensor SHT21 and HTU21
    AMS_5600 as5600;                // Rotation sensor AS5600
    INA226 ina226_1(INA226_I2C_ADDR1);// Power management sensor INA226 Battery
    INA226 ina226_2(INA226_I2C_ADDR2);// Power management sensor INA226 Solar
    INA226 ina226_3(INA226_I2C_ADDR3);// Power management sensor INA226 Generator
    RTC_DS1388 ds1388;              // RTC DS1388
    OneWire oneWire(OBP_1WIRE);     // 1Wire bus
    DallasTemperature ds18b20(&oneWire);// Sensors for DS18B20
    DeviceAddress tempDeviceAddress;// Table for DS18B20 device addresses 

    // Init sensor stuff
    bool oneWire_ready = false;     // 1Wire initialized and ready to use
    bool iRTC_ready = false;        // Software RTC initialized and ready to use
    bool RTC_ready = false;         // DS1388 initialized and ready to use
    bool GPS_ready = false;         // GPS initialized and ready to use
    bool N2K_GPS_ready = false;     // GPS time on N2K bus
    bool BME280_ready = false;      // BME280 initialized and ready to use
    bool BMP280_ready = false;      // BMP280 initialized and ready to use
    bool BMP180_ready = false;      // BMP180 initialized and ready to use
    bool SHT21_ready = false;       // SHT21 initialized and ready to use
    bool AS5600_ready = false;      // AS5600 initialized and ready to use
    bool INA226_1_ready = false;    // INA226_1 initialized and ready to use
    bool INA226_2_ready = false;    // INA226_2 initialized and ready to use
    bool INA226_3_ready = false;    // INA226_3 initialized and ready to use

    // Create integer arrays for average building
    const int avgsize = 300;
    constexpr int arrayBatV{avgsize};
    constexpr int arrayBatC{avgsize};
    movingAvg batV(arrayBatV);
    movingAvg batC(arrayBatC);
    batV.begin();
    batC.begin();

    // Start timer
    Timer1.start(); // Start Timer1 for blinking LED

    // Direction settings for NMEA0183
    String nmea0183Mode = api->getConfig()->getConfigItem(api->getConfig()->serialDirection, true)->asString();
    api->getLogger()->logDebug(GwLog::LOG, "NMEA0183 Mode is: %s", nmea0183Mode.c_str());
    pinMode(OBP_DIRECTION_PIN, OUTPUT);
    if (String(nmea0183Mode) == "receive" || String(nmea0183Mode) == "off")
    {
        digitalWrite(OBP_DIRECTION_PIN, false);
    }
    if (String(nmea0183Mode) == "send")
    {
        digitalWrite(OBP_DIRECTION_PIN, true);
    }

    // Internal voltage sensor initialization
    String powsensor1 = api->getConfig()->getConfigItem(api->getConfig()->usePowSensor1, true)->asString();
    double voffset = (api->getConfig()->getConfigItem(api->getConfig()->vOffset,true)->asString()).toFloat();
    double vslope = (api->getConfig()->getConfigItem(api->getConfig()->vSlope,true)->asString()).toFloat();
    if(String(powsensor1) == "off"){
        #ifdef VOLTAGE_SENSOR
        float rawVoltage = (float(analogRead(OBP_ANALOG0)) * 3.3 / 4096 + 0.53) * 2;   // Vin = 1/2 for OBP40
        #else
        float rawVoltage = (float(analogRead(OBP_ANALOG0)) * 3.3 / 4096 + 0.17) * 20;   // Vin = 1/20 for OBP60    
        #endif
        sensors.batteryVoltage = rawVoltage * vslope + voffset; // Calibration
        #ifdef LIPO_ACCU_1200
        sensors.BatteryChargeStatus = 0;    // Set to discharging
        sensors.batteryLevelLiPo = 0;       // Level 0...100%
        #endif
        sensors.batteryCurrent = 0;
        sensors.batteryPower = 0;
        // Fill average arrays with start values
        for (int i=1; i<=avgsize+1; ++i) {
            batV.reading(int(sensors.batteryVoltage * 100));
            batC.reading(int(sensors.batteryCurrent * 10));
        }
    }

    // Settings for 1Wire bus
    String oneWireOn=api->getConfig()->getConfigItem(api->getConfig()->useTempSensor,true)->asString();
    int numberOfDevices;
    if(String(oneWireOn) == "DS18B20"){
        ds18b20.begin();
        DeviceAddress tempDeviceAddress;
        numberOfDevices = ds18b20.getDeviceCount();
        // Limit for 8 sensors
        if(numberOfDevices > 8){
            numberOfDevices = 8;
        }
        if (numberOfDevices < 1) {
            oneWire_ready = false;
            api->getLogger()->logDebug(GwLog::ERROR,"Modul DS18B20 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"1Wire modul found at:");
            for(int i=0;i<numberOfDevices; i++){
                // Search the wire for address
                if(ds18b20.getAddress(tempDeviceAddress, i)){
                    api->getLogger()->logDebug(GwLog::LOG,"DS18B20-%01d: %12d", i, tempDeviceAddress[i]);
                } else {
                    api->getLogger()->logDebug(GwLog::LOG,"DS18B20-%01d: Sensor with errors, check wiring!", i);
                }
            }        
            oneWire_ready = true;
        }
    }

