thooge/esp32-nmea2000-obp60/lib/obp60task/OBPSensorTask.cpp
    // Settings for RTC
    String rtcOn=api->getConfig()->getConfigItem(api->getConfig()->useRTC,true)->asString();
    if(String(rtcOn) == "DS1388"){
        if (!ds1388.begin()) {
            RTC_ready = false;
            api->getLogger()->logDebug(GwLog::ERROR,"Modul DS1388 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"Modul DS1388 found");
            uint year = ds1388.now().year();
            if(year < 2023){
                // ds1388.adjust(DateTime(__DATE__, __TIME__));  // Set date and time from PC file time
            }
            RTC_ready = true;
            sensors.rtcValid = true;
        }
    }

    // Settings for GPS sensors
    String gpsOn=api->getConfig()->getConfigItem(api->getConfig()->useGPS,true)->asString();
    uint hdopAccuracy = uint(api->getConfig()->getConfigItem(api->getConfig()->hdopAccuracy,true)->asInt());
    if(String(gpsOn) == "NEO-6M"){
        Serial2.begin(9600, SERIAL_8N1, OBP_GPS_RX, OBP_GPS_TX, false); // not inverted (false)
        if (!Serial2) {     
            api->getLogger()->logDebug(GwLog::ERROR,"GPS modul NEO-6M not found, check wiring");
            GPS_ready = false;
            }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"GPS modul NEO-M6 found");
            NMEA0183.SetMessageStream(&Serial2);
            NMEA0183.Open();
            GPS_ready = true;
        }
    }
    if(String(gpsOn) == "NEO-M8N"){
        Serial2.begin(9600, SERIAL_8N1, OBP_GPS_RX, OBP_GPS_TX, false); // not inverted (false)
        if (!Serial2) {     
            api->getLogger()->logDebug(GwLog::ERROR,"GPS modul NEO-M8N not found, check wiring");
            GPS_ready = false;
            }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"GPS modul NEO-M8N found");
            NMEA0183.SetMessageStream(&Serial2);
            NMEA0183.Open();
            GPS_ready = true;
        }
    }
    if(String(gpsOn) == "ATGM336H"){
        Serial2.begin(9600, SERIAL_8N1, OBP_GPS_RX, OBP_GPS_TX, false); // not inverted (false)
        if (!Serial2) {     
            api->getLogger()->logDebug(GwLog::ERROR,"GPS modul ATGM336H not found, check wiring");
            GPS_ready = false;
            }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"GPS modul ATGM336H found");
            NMEA0183.SetMessageStream(&Serial2);
            NMEA0183.Open();
            GPS_ready = true;
        }
    }
    
    // Settings for environment sensors on I2C bus
    String envSensors=api->getConfig()->getConfigItem(api->getConfig()->useEnvSensor,true)->asString();

    if(String(envSensors) == "BME280"){
        if (!bme280.begin(BME280_I2C_ADDR)) {
            api->getLogger()->logDebug(GwLog::ERROR,"Modul BME280 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"Modul BME280 found");
            sensors.airTemperature = bme280.readTemperature();
            sensors.airPressure = bme280.readPressure();
            sensors.airHumidity = bme280.readHumidity();
            BME280_ready = true;
        }
    }
    else if(String(envSensors) == "BMP280"){
        if (!bmp280.begin(BMP280_I2C_ADDR)) {
            api->getLogger()->logDebug(GwLog::ERROR,"Modul BMP280 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"Modul BMP280 found");
            sensors.airTemperature = bmp280.readTemperature();
            sensors.airPressure = bmp280.readPressure();
            BMP280_ready = true;
        }
    }
    else if(String(envSensors) == "BMP085" || String(envSensors) == "BMP180"){
        if (!bmp085.begin()) {
            api->getLogger()->logDebug(GwLog::ERROR,"Modul BMP085/BMP180 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"Modul BMP085/BMP180 found");
            sensors.airTemperature = bmp085.readTemperature();
            sensors.airPressure = bmp085.readPressure();
            BMP180_ready = true;
        }
    }
    else if(String(envSensors) == "HTU21" || String(envSensors) == "SHT21"){
        if (!sht21.begin()) {
            api->getLogger()->logDebug(GwLog::ERROR,"Modul HTU21/SHT21 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"Modul HTU21/SHT21 found");
            sensors.airHumidity = sht21.readCompensatedHumidity();
            sensors.airTemperature = sht21.readTemperature();
            SHT21_ready = true;
        }
    }

    // Settings for rotation sensors AS5600 on I2C bus
    String envsensor = api->getConfig()->getConfigItem(api->getConfig()->useEnvSensor, true)->asString();
    String rotsensor = api->getConfig()->getConfigItem(api->getConfig()->useRotSensor, true)->asString();
    String rotfunction = api->getConfig()->getConfigItem(api->getConfig()->rotFunction, true)->asString();
    String rotSensor=api->getConfig()->getConfigItem(api->getConfig()->useRotSensor,true)->asString();
    
    if(String(rotSensor) == "AS5600"){
        Wire.beginTransmission(AS5600_I2C_ADDR);
        if (Wire.endTransmission() != 0) {
            api->getLogger()->logDebug(GwLog::ERROR,"Modul AS5600 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"Modul AS5600 found");
            sensors.rotationAngle = DegToRad(as5600.getRawAngle() * 0.087);   // 0...4095 segments = 0.087 degree
            //sensors.magnitude = as5600.getMagnitude();              // Magnetic magnitude in [mT]
            AS5600_ready = true;
        }
    }

    // Settings for power amangement sensors INA226 #1 for Battery on I2C bus
    String shunt1 = api->getConfig()->getConfigItem(api->getConfig()->shunt1, true)->asString();
    // Settings for power amangement sensors INA226 #1 for Solar on I2C bus
    String powsensor2 = api->getConfig()->getConfigItem(api->getConfig()->usePowSensor2, true)->asString();
    String shunt2 = api->getConfig()->getConfigItem(api->getConfig()->shunt2, true)->asString();
    // Settings for power amangement sensors INA226 #1 for Generator on I2C bus
    String powsensor3 = api->getConfig()->getConfigItem(api->getConfig()->usePowSensor3, true)->asString();
    String shunt3 = api->getConfig()->getConfigItem(api->getConfig()->shunt3, true)->asString();

    float shuntResistor = 1.0;  // Default value for shunt resistor
    float maxCurrent = 10.0;    // Default value for max. current
    float corrFactor = 1;       // Correction factor for fix calibration
    
    // Battery sensor initialization
    if(String(powsensor1) == "INA226"){
        if (!ina226_1.begin()){
            api->getLogger()->logDebug(GwLog::ERROR,"Modul 1 INA226 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"Modul 1 INA226 found");
            shuntResistor = SHUNT_VOLTAGE / float(shunt1.toInt());  // Calculate shunt resisitor for max. shunt voltage 75mV
            maxCurrent = shunt1.toFloat();
            api->getLogger()->logDebug(GwLog::LOG,"Calibation Modul 2 INA226, Imax:%3.0fA Rs:%7.5fOhm Us:%5.3f", maxCurrent, shuntResistor, SHUNT_VOLTAGE);
//            ina226_1.setMaxCurrentShunt(maxCurrent, shuntResistor);
            ina226_1.setMaxCurrentShunt(10, 0.01);  // Calibration with fix values (because the original values outer range)
            corrFactor = (maxCurrent / 10) * (0.001 / shuntResistor) / (maxCurrent / 100); // Correction factor for fix calibration
            sensors.batteryVoltage = ina226_1.getBusVoltage();
            sensors.batteryCurrent = ina226_1.getCurrent() * corrFactor;
            sensors.batteryPower = ina226_1.getPower() * corrFactor;
            // Fill average arrays with start values
            for (int i=1; i<=avgsize+1; ++i) {
                batV.reading(int(sensors.batteryVoltage * 100));
                batC.reading(int(sensors.batteryCurrent * 10));
            }
            INA226_1_ready = true;
        }
    }

    // Solar sensor initialization
    if(String(powsensor2) == "INA226"){
        if (!ina226_2.begin()){
            api->getLogger()->logDebug(GwLog::ERROR,"Modul 2 INA226 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"Modul 2 INA226 found");
            shuntResistor = SHUNT_VOLTAGE / float(shunt2.toInt());  // Calculate shunt resisitor for max. shunt voltage 75mV
            maxCurrent = shunt2.toFloat();
            api->getLogger()->logDebug(GwLog::LOG,"Calibation Modul 2 INA226, Imax:%3.0fA Rs:%7.5fOhm Us:%5.3f", maxCurrent, shuntResistor, SHUNT_VOLTAGE);
//            ina226_1.setMaxCurrentShunt(maxCurrent, shuntResistor);
            ina226_2.setMaxCurrentShunt(10, 0.01);  // Calibration with fix values (because the original values outer range)
            corrFactor = (maxCurrent / 10) * (0.001 / shuntResistor) / (maxCurrent / 100); // Correction factor for fix calibration
            sensors.solarVoltage = ina226_2.getBusVoltage();
            sensors.solarCurrent = ina226_2.getCurrent() * corrFactor;
            sensors.solarPower = ina226_2.getPower() * corrFactor;
            // Fill average arrays with start values
            INA226_2_ready = true;
        }
    }

    // Generator sensor initialization
    if(String(powsensor3) == "INA226"){
        if (!ina226_3.begin()){
            api->getLogger()->logDebug(GwLog::ERROR,"Modul 3 INA226 not found, check wiring");
        }
        else{
            api->getLogger()->logDebug(GwLog::LOG,"Modul 3 INA226 found");
            shuntResistor = SHUNT_VOLTAGE / float(shunt3.toInt());  // Calculate shunt resisitor for max. shunt voltage 75mV
            maxCurrent = shunt3.toFloat();
            api->getLogger()->logDebug(GwLog::LOG,"Calibation Modul 3 INA226, Imax:%3.0fA Rs:%7.5fOhm Us:%5.3f", maxCurrent, shuntResistor, SHUNT_VOLTAGE);
//            ina226_1.setMaxCurrentShunt(maxCurrent, shuntResistor);
            ina226_3.setMaxCurrentShunt(10, 0.01);  // Calibration with fix values (because the original values outer range)
            corrFactor = (maxCurrent / 10) * (0.001 / shuntResistor) / (maxCurrent / 100); // Correction factor for fix calibration
            sensors.generatorVoltage = ina226_3.getBusVoltage();
            sensors.generatorCurrent = ina226_3.getCurrent() * corrFactor;
            sensors.generatorPower = ina226_3.getPower() * corrFactor;
            // Fill average arrays with start values
            INA226_3_ready = true;
        }
    }

    int rotoffset = api->getConfig()->getConfigItem(api->getConfig()->rotOffset,true)->asInt();

    static long loopCounter = 0;    // Loop counter for 1Wire data transmission
    long starttime0 = millis();     // GPS update all 100ms
    long starttime5 = millis();     // Voltage update all 1s
    long starttime6 = millis();     // Environment sensor update all 1s
    long starttime7 = millis();     // Rotation sensor update all 500ms
    long starttime8 = millis();     // Battery power sensor update all 1s
    long starttime9 = millis();     // Solar power sensor update all 1s
    long starttime10 = millis();    // Generator power sensor update all 1s
    long starttime11 = millis();    // Copy GPS data to RTC all 5min
    long starttime12 = millis();    // Get RTC data all 500ms
    long starttime13 = millis();    // Get 1Wire sensor data all 2s

