thooge/esp32-nmea2000-obp60/lib/obp60task/OBPSensorTask.cpp
    tN2kMsg N2kMsg;
    shared->setSensorData(sensors); //set initially read values

    GwApi::BoatValue *gpsdays=new GwApi::BoatValue(GwBoatData::_GPSD);
    GwApi::BoatValue *gpsseconds=new GwApi::BoatValue(GwBoatData::_GPST);
    GwApi::BoatValue *hdop=new GwApi::BoatValue(GwBoatData::_HDOP);
    GwApi::BoatValue *valueList[]={gpsdays, gpsseconds, hdop};

    // Internal iRTC with NTP init
    ESP32Time rtc(0);
    if (api->getConfig()->getString(api->getConfig()->timeSource) == "iRTC") {
        GwApi::Status status;
        api->getStatus(status);
        if (status.wifiClientConnected) {
            const char *ntpServer = api->getConfig()->getCString(api->getConfig()->timeServer);
            api->getLogger()->logDebug(GwLog::LOG,"Fetching date and time from NTP server '%s'.", ntpServer);
            configTime(0, 0, ntpServer); // get time in UTC
            struct tm timeinfo;
            if (getLocalTime(&timeinfo)) {
                api->getLogger()->logDebug(GwLog::LOG,"NTP time: %04d-%02d-%02d %02d:%02d:%02d UTC", timeinfo.tm_year+1900, timeinfo.tm_mon+1, timeinfo.tm_mday, timeinfo.tm_hour, timeinfo.tm_min, timeinfo.tm_sec);
                rtc.setTimeStruct(timeinfo);
                iRTC_ready = true;
                sensors.rtcValid = true;
            } else {
                api->getLogger()->logDebug(GwLog::LOG,"NTP time fetch failed!");
            }
        } else {
            api->getLogger()->logDebug(GwLog::LOG,"Wifi client not connected, NTP not available.");
        }
    }

    // Sensor task loop runs with 100ms
    //####################################################################################

    while (true){
        delay(100);                 // Loop time 100ms
        Timer1.update();            // Update for Timer2
        if (millis() > starttime0 + 100)
        {
            starttime0 = millis();
            // Send NMEA0183 GPS data on several bus systems (N2K an 0183) all 100ms
            if (GPS_ready == true && hdop->value <= hdopAccuracy)
            {
                SNMEA0183Msg NMEA0183Msg;
                while (NMEA0183.GetMessageCor(NMEA0183Msg))
                {
                    api->sendNMEA0183Message(NMEA0183Msg);
                }
            }
            
        }

        /*
        Time set logic for RTC and N2K
        ###############################

        iRTC = Software RTC updatetd with NTP via internet
        RTC = RTC chip on PCB
        GPS = GPS Receiver on PCB
        N2K = GPS time on N2K od 183 bus
        0 = device not ready
        1 = device ready
        X = independend
        () = source for set time N2K
        -> = set RTC via iRTC
        <- = set RTC via GPS

        iRTC  RTC  GPS N2K
          0    0    0  (1)
          0    0   (1)  X 
          0   (1)   0   X 
          0    1 <-(1)  X 
         (1)   0    0   X 
          1    0   (1)  X 
          1 ->(1)   0   X 
          1    1 <-(1)  X 

        */

        // If RTC DS1388 ready, then copy iRTC and GPS data to RTC all 1 min
        if(millis() > starttime11 + 1*60*1000){
            starttime11 = millis();
            // Set RTC chip via iRTC (NTP)
            if(iRTC_ready == true && RTC_ready == true && GPS_ready == false){
                GwApi::Status status;
                api->getStatus(status);
                // Check WiFi connection
                if (status.wifiClientConnected) {
                    sensors.rtcTime = rtc.getTimeStruct();  // Get time from software RTC (iRTC)      
                    DateTime now = DateTime(
                        sensors.rtcTime.tm_year + 1900,
                        sensors.rtcTime.tm_mon + 1,
                        sensors.rtcTime.tm_mday,
                        sensors.rtcTime.tm_hour,
                        sensors.rtcTime.tm_min,
                        sensors.rtcTime.tm_sec
                    );   
                    ds1388.adjust(now);
                }    
            }
            // Set RTC chip via internal GPS
            if(rtcOn == "DS1388" && RTC_ready == true && GPS_ready == true){
                api->getBoatDataValues(3,valueList);
                if(gpsdays->valid && gpsseconds->valid && hdop->valid){
                    long ts = tNMEA0183Msg::daysToTime_t(gpsdays->value - (30*365+7))+floor(gpsseconds->value); // Adjusted to reference year 2000 (-30 years and 7 days for switch years)
                    // sample input: date = "Dec 26 2009", time = "12:34:56"
                    // ds1388.adjust(DateTime("Dec 26 2009", "12:34:56"));
                    DateTime adjusttime(ts);
                    api->getLogger()->logDebug(GwLog::LOG,"Adjust RTC time via internal GPS: %04d/%02d/%02d %02d:%02d:%02d",adjusttime.year(), adjusttime.month(), adjusttime.day(), adjusttime.hour(), adjusttime.minute(), adjusttime.second());
                    // Adjust RTC time as unix time value
                    ds1388.adjust(adjusttime);
                }
            }    
        }

        // Set RTC chip via N2K or 183 in case the internal GPS is off (only one time)
        if(N2K_GPS_ready == false && RTC_ready == true && GPS_ready == false){
            api->getBoatDataValues(3,valueList);
            if(gpsdays->valid && gpsseconds->valid && hdop->valid){
                long ts = tNMEA0183Msg::daysToTime_t(gpsdays->value - (30*365+7))+floor(gpsseconds->value); // Adjusted to reference year 2000 (-30 years and 7 days for switch years)
                // sample input: date = "Dec 26 2009", time = "12:34:56"
                // ds1388.adjust(DateTime("Dec 26 2009", "12:34:56"));
                DateTime adjusttime(ts);
                api->getLogger()->logDebug(GwLog::LOG,"Adjust RTC time via N2K/183: %04d/%02d/%02d %02d:%02d:%02d",adjusttime.year(), adjusttime.month(), adjusttime.day(), adjusttime.hour(), adjusttime.minute(), adjusttime.second());
                // Adjust RTC time as unix time value
                ds1388.adjust(adjusttime);
                // N2K GPS time ready
                N2K_GPS_ready = true;
            }    
        }

        // Send RTC date and time to N2K all 500ms
        if (millis() > starttime12 + 500) {
            starttime12 = millis();
            // Send date and time from RTC chip if GPS not ready
            if (rtcOn == "DS1388" && RTC_ready) {
                DateTime dt = ds1388.now();
                sensors.rtcTime.tm_year  = dt.year() - 1900; // Save values in SensorData
                sensors.rtcTime.tm_mon = dt.month() - 1;
                sensors.rtcTime.tm_mday = dt.day();
                sensors.rtcTime.tm_hour = dt.hour();
                sensors.rtcTime.tm_min = dt.minute();
                sensors.rtcTime.tm_sec = dt.second();
                sensors.rtcTime.tm_isdst = 0; // Not considering daylight saving time

                // If GPS not ready or installed then send RTC time on bus
                // TODO If there are other time sources on the bus there should
                //      be a logic not to send or to send with lower frequency
                //      or something totally different
                if ((GPS_ready == false) || (GPS_ready == true && hdop->valid == false)) {
                    // TODO implement daysAt1970 and sysTime as methods of DateTime
                    const short daysOfYear[12] = {0,31,59,90,120,151,181,212,243,273,304,334};
                    uint16_t switchYear = ((dt.year()-1)-1968)/4 - ((dt.year()-1)-1900)/100 + ((dt.year()-1)-1600)/400;
                    long daysAt1970 = (dt.year()-1970)*365 + switchYear + daysOfYear[dt.month()-1] + dt.day()-1;
                    // If switch year then add one day
                    if ((dt.month() > 2) && (dt.year() % 4 == 0  && (dt.year() % 100 != 0 || dt.year() % 400 == 0))) {
                        daysAt1970 += 1;
                    }
                    // N2K sysTime is double in n2klib
                    double sysTime = (dt.hour() * 3600) + (dt.minute() * 60) + dt.second();
                    if(!isnan(daysAt1970) && !isnan(sysTime)){
                        //api->getLogger()->logDebug(GwLog::LOG,"RTC time: %04d/%02d/%02d %02d:%02d:%02d",sensors.rtcTime.tm_year+1900,sensors.rtcTime.tm_mon+1, sensors.rtcTime.tm_mday, sensors.rtcTime.tm_hour, sensors.rtcTime.tm_min, sensors.rtcTime.tm_sec);
                        //api->getLogger()->logDebug(GwLog::LOG,"Send PGN126992: %10d %10d",daysAt1970, (uint16_t)sysTime);
                        SetN2kPGN126992(N2kMsg,0,daysAt1970,sysTime,N2ktimes_LocalCrystalClock);
                        api->sendN2kMessage(N2kMsg);
                    }
                }
            }
            // Send date and time from software RTC (iRTC)
            if (iRTC_ready == true && RTC_ready == false && GPS_ready == false) {
                sensors.rtcTime = rtc.getTimeStruct();

                const short daysOfYear[12] = {0,31,59,90,120,151,181,212,243,273,304,334};
                int year  = sensors.rtcTime.tm_year + 1900;
                int month = sensors.rtcTime.tm_mon;
                int day   = sensors.rtcTime.tm_mday;
                uint16_t switchYear = ((year - 1) - 1968) / 4 - ((year - 1) - 1900) / 100 + ((year - 1) - 1600) / 400;
                long daysAt1970 = (year - 1970) * 365L + switchYear + daysOfYear[month] + day - 1;

                // Leap day add if date is after Feb (i.e. month >= March)
                if (month >= 2 && (year % 4 == 0 && (year % 100 != 0 || year % 400 == 0))) {
                    daysAt1970 += 1;
                }
                double sysTime = sensors.rtcTime.tm_hour * 3600.0 + sensors.rtcTime.tm_min  * 60.0 + sensors.rtcTime.tm_sec;
                //api->getLogger()->logDebug(GwLog::LOG, "iRTC time: %04d/%02d/%02d %02d:%02d:%02d", year, month + 1, day, sensors.rtcTime.tm_hour, sensors.rtcTime.tm_min, sensors.rtcTime.tm_sec);
                //api->getLogger()->logDebug(GwLog::LOG,"Send PGN126992: %10d %10d",daysAt1970, (uint16_t)sysTime);
                SetN2kPGN126992(N2kMsg, 0, daysAt1970, sysTime, N2ktimes_LocalCrystalClock);
                api->sendN2kMessage(N2kMsg);
            }

