thooge/esp32-nmea2000-obp60/lib/obp60task/OBPSensorTask.cpp
                // Calculate power value
                sensors.solarPower = sensors.solarVoltage * sensors.solarCurrent; // more stable
            }
            // Send solar live data to NMEA200 bus
            if(!isnan(sensors.solarVoltage) && !isnan(sensors.solarCurrent)){
                SetN2kDCBatStatus(N2kMsg, 1, sensors.solarVoltage, sensors.solarCurrent, N2kDoubleNA, 1);
                api->sendN2kMessage(N2kMsg);
            }
        }

        // Send generator power value to N2K all 1s
        if(millis() > starttime10 + 1000 && (String(powsensor3) == "INA219" || String(powsensor3) == "INA226")){
            starttime10 = millis();
            if(String(powsensor3) == "INA226" && INA226_3_ready == true){
                double voltage = ina226_3.getBusVoltage();
                // Limiter for voltage average building
                if(voltage < 0){
                    voltage = 0;
                }
                if(voltage > 30){
                    voltage = 30;
                }
                sensors.generatorVoltage = voltage;
                sensors.generatorCurrent = ina226_3.getCurrent() * corrFactor;
                // Eliminates bit jitter by zero current values
                float factor = maxCurrent / 100;
                if(sensors.generatorCurrent >= (-0.015 * factor) && sensors.generatorCurrent <= (0.015 * factor)){
                    sensors.generatorCurrent = 0;
                }
                
                // Calculate power value
                sensors.generatorPower = sensors.generatorVoltage * sensors.generatorCurrent; // more stable
            }
            // Send solar live data to NMEA200 bus
            if(!isnan(sensors.generatorVoltage) && !isnan(sensors.generatorCurrent)){
                SetN2kDCBatStatus(N2kMsg, 2, sensors.generatorVoltage, sensors.generatorCurrent, N2kDoubleNA, 1);
                api->sendN2kMessage(N2kMsg);
            }
        }

        shared->setSensorData(sensors);
    }
    vTaskDelete(NULL);
}


void createSensorTask(SharedData *shared){
    xTaskCreate(sensorTask,"readSensors",10000,shared,3,NULL);
}
#endif
